command1:
  sendblock:
    cmd: conf-read
    data: server
  receive:
    type: block

command2:
  sendblock:
    cmd: conf-set
    section: zone
    item: domain
    data: testing1234
  receive:
    type: block

command3:
  sendblock:
    cmd: conf-set
    section: zone
    item: domain
    data:
      domain: example.com
      ip: 69.69.69.69
  receive:
    type: block

command4:
  sendblock:
    cmd: conf-set
    section: zone
    item: domain
    data:
      - domain: example.com
      - ip: 69.69.69.69
  receive:
    type: block

command5:
  sendblock:
    cmd: conf-commit
  receive:
    type: block
